ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_error_aggregator_config_regs.xml
<module id="ERROR_AGGREGATOR_CONFIG_REGS" HW_revision="" description="ERROR AGGREGATOR CONFIG Registers">
	<register id="CPU1_PR_HIGHPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="CPU1 PR Error aggregator High Priority Error address register">
		<bitfield id="CPU1_PR_HIGHPRIO_ERROR_ADDRESS" description="Address at which first High priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1_PR_LOWPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="CPU1 PR Error aggregator Low Priority Error address register">
		<bitfield id="CPU1_PR_LOWPRIO_ERROR_ADDRESS" description="Address at which first Low priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1_PR_ERROR_TYPE" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="CPU1 PR Error aggregator Error Type Register">
		<bitfield id="INSTR_SECURITY_VIO" description="Instruction packet security violation." begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="SEC_ENTRY_VIO" description="Secure entry and linear code crossing error." begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="SEC_EXIT_VIO" description="Secure exit error" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="MAX_PSP_ERR" description=" MAX PSP error" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="ACC_TIMEOUT_ERR" description=" Access timeout error " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error " begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description=" Uncorrectable error " begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CERR" description="Correctable error " begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="WARN_PSP_ERR" description="Warn PSP error" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="SW_BREAKPOINT_ERR" description="Software brakepoint error" begin="9" end="9" width="1" rwaccess="R"/>
		<bitfield id="ILLEGAL_INSTRUCTION" description="Illegal instruction error" begin="10" end="10" width="1" rwaccess="R"/>
		<bitfield id="INSTRUCTION_TIMEOUT" description="Instruction timeout error" begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Low Priority error set by software" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="HP_SOFTWARE_ERR" description="high priority error set by software" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="CPU1_PR_ERROR_TYPE_FRC" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="CPU1 PR Error aggregator Error Type Force Register">
		<bitfield id="INSTR_SECURITY_VIO" description="Instruction packet security violation force." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SEC_ENTRY_VIO" description="Secure entry and linear code crossing error force." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SEC_EXIT_VIO" description="Secure exit error force" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MAX_PSP_ERR" description=" MAX PSP error force" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description=" Access timeout error force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description=" Uncorrectable error force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error force" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="WARN_PSP_ERR" description="Warn PSP error force" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SW_BREAKPOINT_ERR" description="Software brakepoint error force" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ILLEGAL_INSTRUCTION" description="Illegal instruction error force" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INSTRUCTION_TIMEOUT" description="Instruction timeout error force" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Force low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="Force high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CPU1_PR_ERROR_TYPE_CLR" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="CPU1 PR Error aggregator Error Type Clear Register">
		<bitfield id="INSTR_SECURITY_VIO" description="Instruction packet security violation clear." begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SEC_ENTRY_VIO" description="Secure entry and linear code crossing error clear." begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SEC_EXIT_VIO" description="Secure exit error clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MAX_PSP_ERR" description=" MAX PSP error clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description=" Access timeout error clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description=" Uncorrectable error clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="WARN_PSP_ERR" description="Warn PSP error clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SW_BREAKPOINT_ERR" description="Software brakepoint error clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ILLEGAL_INSTRUCTION" description="Illegal instruction error clear" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="INSTRUCTION_TIMEOUT" description="Instruction timeout error clear" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="clear low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="clear high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CPU1_PR_PC" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="CPU1 PR Error aggregator Register to store PC value at the first High priority error event">
		<bitfield id="CPU1_PR_PC" description="CPU1  PC at which first High priority error occurred " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1_DR1_HIGHPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x40" instances="1" instaddr="4" internal="0" description="CPU1 DR1 Error aggregator High Priority Error address register">
		<bitfield id="CPU1_DR1_HIGHPRIO_ERROR_ADDRESS" description="Address at which first High priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1_DR1_LOWPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x44" instances="1" instaddr="4" internal="0" description="CPU1 DR1 Error aggregator Low Priority Error address register">
		<bitfield id="CPU1_DR1_LOWPRIO_ERROR_ADDRESS" description="Address at which first Low priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1_DR1_ERROR_TYPE" width="32" page="0" offset="0x48" instances="1" instaddr="4" internal="0" description="CPU1 DR1 Error aggregator Error Type Register">
		<bitfield id="SECURITY_VIO" description="Security violation" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error " begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description="Uncorrectable error " begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CERR" description="Correctable error " begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="UNALIGNED_ADDR_ERR" description="Unaligned address error" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Low Priority error set by software" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="HP_SOFTWARE_ERR" description="high priority error set by software" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="CPU1_DR1_ERROR_TYPE_FRC" width="32" page="0" offset="0x4c" instances="1" instaddr="4" internal="0" description="CPU1 DR1 Error aggregator Error Type Force Register">
		<bitfield id="SECURITY_VIO" description="Security violation force" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error force" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="UNALIGNED_ADDR_ERR" description="Unaligned address error force" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Force low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="force high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
