ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_error_aggregator_config_regs.xml
	<register id="CPU1_DR1_ERROR_TYPE_CLR" width="32" page="0" offset="0x50" instances="1" instaddr="4" internal="0" description="CPU1 DR1 Error aggregator Error Type Clear Register">
		<bitfield id="SECURITY_VIO" description="Security violation clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="UNALIGNED_ADDR_ERR" description="Unaligned address error clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="clear low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="clear high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CPU1_DR1_PC" width="32" page="0" offset="0x54" instances="1" instaddr="4" internal="0" description="CPU1 DR1 Error aggregator Register to store PC value at the first High priority error event">
		<bitfield id="CPU1_DR1_PC" description="CPU1 PC at which first High priority error occurred " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1_DR2_HIGHPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x80" instances="1" instaddr="4" internal="0" description="CPU1 DR2 Error aggregator High Priority Error address register">
		<bitfield id="CPU1_DR2_HIGHPRIO_ERROR_ADDRESS" description="Address at which first High priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1_DR2_LOWPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x84" instances="1" instaddr="4" internal="0" description="CPU1 DR2 Error aggregator Low Priority Error address register">
		<bitfield id="CPU1_DR2_LOWPRIO_ERROR_ADDRESS" description="Address at which first Low priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1_DR2_ERROR_TYPE" width="32" page="0" offset="0x88" instances="1" instaddr="4" internal="0" description="CPU1 DR2 Error aggregator Error Type Register">
		<bitfield id="SECURITY_VIO" description="Security violation" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error " begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description="Uncorrectable error " begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CERR" description="Correctable error " begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="UNALIGNED_ADDR_ERR" description="Unaligned address error" begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Low Priority error set by software" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="HP_SOFTWARE_ERR" description="high priority error set by software" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="CPU1_DR2_ERROR_TYPE_FRC" width="32" page="0" offset="0x8c" instances="1" instaddr="4" internal="0" description="CPU1 DR2 Error aggregator Error Type Force Register">
		<bitfield id="SECURITY_VIO" description="Security violation force" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error force" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="UNALIGNED_ADDR_ERR" description="Unaligned address error force" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Force low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="force high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CPU1_DR2_ERROR_TYPE_CLR" width="32" page="0" offset="0x90" instances="1" instaddr="4" internal="0" description="CPU1 DR2 Error aggregator Error Type Clear Register">
		<bitfield id="SECURITY_VIO" description="Security violation clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="UNALIGNED_ADDR_ERR" description="Unaligned address error clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="clear low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="clear high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CPU1_DR2_PC" width="32" page="0" offset="0x94" instances="1" instaddr="4" internal="0" description="CPU1 DR2 Error aggregator Register to store PC value at the first High priority error event">
		<bitfield id="CPU1_DR2_PC" description="CPU1 PC at which first High priority error occurred " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1_DW_HIGHPRIO_ERROR_ADDRESS" width="32" page="0" offset="0xc0" instances="1" instaddr="4" internal="0" description="CPU1 DW Error aggregator High Priority Error address register">
		<bitfield id="CPU1_DW_HIGHPRIO_ERROR_ADDRESS" description="Address at which first High priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="CPU1_DW_LOWPRIO_ERROR_ADDRESS" width="32" page="0" offset="0xc4" instances="1" instaddr="4" internal="0" description="CPU1 DW Error aggregator Low Priority Error address register">
		<bitfield id="CPU1_DW_LOWPRIO_ERROR_ADDRESS" description="Address at which first Low priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
