ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_error_aggregator_config_regs.xml
	<register id="CPU3_INT_ERROR_TYPE_CLR" width="32" page="0" offset="0x390" instances="1" instaddr="4" internal="0" description="CPU3 INT Error aggregator Error Type Clear Register">
		<bitfield id="MAIN_ISR_ENTRY_ERR" description="Main ISR entry error clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="MAIN_VECT_CERR" description="Main Correctable vector error clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="MAIN_VECT_UNCERR" description="Main Uncorrectable vector error clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="MAIN_INTERRUPT_RETURN_ERR" description="Main Interrupt return error clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="INT_ISR_ENTRY_ERR" description="INT ISR entry error clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="INT_VECT_CERR" description="INT Correctable vector error clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="INT_VECT_UNCERR" description="INT Uncorrectable vector error clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="INT_INTERRUPT_RETURN_ERR" description="INT INTerrupt return error clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="RTINT_ISR_ENTRY_ERR" description="RTINT ISR entry error clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="RTINT_VECT_CERR" description="RTINT Correctable vector error clear" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="RTINT_VECT_UNCERR" description="RTINT Uncorrectable vector error clear" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="RTINT_INTERRUPT_RETURN_ERR" description="RTINT Interrupt return error clear" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="RTINT_CONTEXT_RESTORE_VECT_CERR" description="RTINT Context restore Correctable vector error clear" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="RTINT_CONTEXT_RESTORE_VECT_UNCERR" description="RTINT Context restore Uncorrectable vector error clear" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="NMI_MAXISP_ERR" description="NMI MAXISP error clear" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="NMI_ISR_ENTRY_ERR" description="NMI ISR entry error clear" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="NMI_VECT_CERR" description="NMI Correctable vector error clear" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="NMI_VECT_UNCERR" description="NMI Uncorrectable vector error clear" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="NMI_INTERRUPT_RETURN_ERR" description="NMI Interrupt return error clear" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="NMI_CONTEXT_RESTORE_VECT_CERR" description="NMI Context restore Correctable vector error clear" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="NMI_CONTEXT_RESTORE_VECT_UNCERR" description="NMI Context restore Uncorrectable vector error clear" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="VECT_CERR" description="Vector Correctable error clear " begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="VECT_UNCERR" description="Vector Uncorrectable error clear " begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="WARNISP" description="warnisp clear" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="MAXISP" description="maxisp clear" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="PIPE_SECURITY_VIO" description="PIPE security violation clear" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="REG_PARITY_ERR" description="PIPE Reg parity error clear" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="REG_PARITY_DIAG_ERR" description="PIPE Register parity diag error clear" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="PIPE_LOCK_KEY_ERR" description="PIPE Lock key error clear" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="clear low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="clear high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="CPU3_INT_PC" width="32" page="0" offset="0x394" instances="1" instaddr="4" internal="0" description="CPU3 INT Error aggregator Register to store PC value at the first High priority error event">
		<bitfield id="CPU3_INT_PC" description="CPU3 PC at which first High priority error occurred " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RTDMA1_DR_HIGHPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x780" instances="1" instaddr="4" internal="0" description="RTDMA1 DR Error aggregator High Priority Error address register">
		<bitfield id="RTDMA1_DR_HIGHPRIO_ERROR_ADDRESS" description="Address at which first High priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RTDMA1_DR_LOWPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x784" instances="1" instaddr="4" internal="0" description="RTDMA1 DR Error aggregator Low Priority Error address register">
		<bitfield id="RTDMA1_DR_LOWPRIO_ERROR_ADDRESS" description="Address at which first Low priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RTDMA1_DR_ERROR_TYPE" width="32" page="0" offset="0x788" instances="1" instaddr="4" internal="0" description="RTDMA1 DR Error aggregator Error Type Register">
		<bitfield id="SECURITY_VIO" description="Security violation" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error " begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description="Uncorrectable error " begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CERR" description="Correctable error " begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Low priority software error" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="HP_SOFTWARE_ERR" description="high priority error set by software" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="RTDMA1_DR_ERROR_TYPE_FRC" width="32" page="0" offset="0x78c" instances="1" instaddr="4" internal="0" description="RTDMA1 DR Error aggregator Error Type Force Register">
		<bitfield id="SECURITY_VIO" description="Security violation force" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error force" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Force low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="force high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="RTDMA1_DR_ERROR_TYPE_CLR" width="32" page="0" offset="0x790" instances="1" instaddr="4" internal="0" description="RTDMA1 DR Error aggregator Error Type Clear Register">
		<bitfield id="SECURITY_VIO" description="Security violation clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="clear low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="clear high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
