ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_error_aggregator_config_regs.xml
	<register id="RTDMA1_DW_HIGHPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x7c0" instances="1" instaddr="4" internal="0" description="RTDMA1 DW Error aggregator High Priority Error address register">
		<bitfield id="RTDMA1_DW_HIGHPRIO_ERROR_ADDRESS" description="Address at which first High priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RTDMA1_DW_LOWPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x7c4" instances="1" instaddr="4" internal="0" description="RTDMA1 DW Error aggregator Low Priority Error address register">
		<bitfield id="RTDMA1_DW_LOWPRIO_ERROR_ADDRESS" description="Address at which first Low priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RTDMA1_DW_ERROR_TYPE" width="32" page="0" offset="0x7c8" instances="1" instaddr="4" internal="0" description="RTDMA1 DW Error aggregator Error Type Register">
		<bitfield id="SECURITY_VIO" description="Security violation" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error " begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description="Uncorrectable error " begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CERR" description="Correctable error " begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Low Priority error set by software" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="HP_SOFTWARE_ERR" description="high priority error set by software" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="RTDMA1_DW_ERROR_TYPE_FRC" width="32" page="0" offset="0x7cc" instances="1" instaddr="4" internal="0" description="RTDMA1 DW Error aggregator Error Type Force Register">
		<bitfield id="SECURITY_VIO" description="Security violation force" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error force" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Force low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="force high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="RTDMA1_DW_ERROR_TYPE_CLR" width="32" page="0" offset="0x7d0" instances="1" instaddr="4" internal="0" description="RTDMA1 DW Error aggregator Error Type Clear Register">
		<bitfield id="SECURITY_VIO" description="Security violation clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="clear low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="clear high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="RTDMA2_DR_HIGHPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x800" instances="1" instaddr="4" internal="0" description="RTDMA2 DR Error aggregator High Priority Error address register">
		<bitfield id="RTDMA2_DR_HIGHPRIO_ERROR_ADDRESS" description="Address at which first High priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RTDMA2_DR_LOWPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x804" instances="1" instaddr="4" internal="0" description="RTDMA2 DR Error aggregator Low Priority Error address register">
		<bitfield id="RTDMA2_DR_LOWPRIO_ERROR_ADDRESS" description="Address at which first Low priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RTDMA2_DR_ERROR_TYPE" width="32" page="0" offset="0x808" instances="1" instaddr="4" internal="0" description="RTDMA2 DR Error aggregator Error Type Register">
		<bitfield id="SECURITY_VIO" description="Security violation" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error " begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description="Uncorrectable error " begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CERR" description="Correctable error " begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Low priority software error" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="HP_SOFTWARE_ERR" description="high priority error set by software" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="RTDMA2_DR_ERROR_TYPE_FRC" width="32" page="0" offset="0x80c" instances="1" instaddr="4" internal="0" description="RTDMA2 DR Error aggregator Error Type Force Register">
		<bitfield id="SECURITY_VIO" description="Security violation force" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error force" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Force low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="force high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
