ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_error_aggregator_config_regs.xml
	<register id="RTDMA2_DR_ERROR_TYPE_CLR" width="32" page="0" offset="0x810" instances="1" instaddr="4" internal="0" description="RTDMA2 DR Error aggregator Error Type Clear Register">
		<bitfield id="SECURITY_VIO" description="Security violation clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="clear low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="clear high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="RTDMA2_DW_HIGHPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x840" instances="1" instaddr="4" internal="0" description="RTDMA2 DW Error aggregator High Priority Error address register">
		<bitfield id="RTDMA2_DW_HIGHPRIO_ERROR_ADDRESS" description="Address at which first High priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RTDMA2_DW_LOWPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x844" instances="1" instaddr="4" internal="0" description="RTDMA2 DW Error aggregator Low Priority Error address register">
		<bitfield id="RTDMA2_DW_LOWPRIO_ERROR_ADDRESS" description="Address at which first Low priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="RTDMA2_DW_ERROR_TYPE" width="32" page="0" offset="0x848" instances="1" instaddr="4" internal="0" description="RTDMA2 DW Error aggregator Error Type Register">
		<bitfield id="SECURITY_VIO" description="Security violation" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error " begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error " begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="UNCERR" description="Uncorrectable error " begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="CERR" description="Correctable error " begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Low Priority error set by software" begin="30" end="30" width="1" rwaccess="R"/>
		<bitfield id="HP_SOFTWARE_ERR" description="high priority error set by software" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="RTDMA2_DW_ERROR_TYPE_FRC" width="32" page="0" offset="0x84c" instances="1" instaddr="4" internal="0" description="RTDMA2 DW Error aggregator Error Type Force Register">
		<bitfield id="SECURITY_VIO" description="Security violation force" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error force" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error force" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error force" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="Force low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="force high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="RTDMA2_DW_ERROR_TYPE_CLR" width="32" page="0" offset="0x850" instances="1" instaddr="4" internal="0" description="RTDMA2 DW Error aggregator Error Type Clear Register">
		<bitfield id="SECURITY_VIO" description="Security violation clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ACC_TIMEOUT_ERR" description="Access timeout error clear" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="ACC_ACK_ERR" description="Access ACK error clear" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="UNCERR" description="Uncorrectable error clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CERR" description="Correctable error clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="LP_SOFTWARE_ERR" description="clear low priority software error" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="clear high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="SSU_HIGHPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x880" instances="1" instaddr="4" internal="0" description="SSU Error aggregator High Priority Error address register">
		<bitfield id="SSU_HIGHPRIO_ERROR_ADDRESS" description="Address at which first high priority SSU error occurred " begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="SSU_ERROR_TYPE" width="32" page="0" offset="0x888" instances="1" instaddr="4" internal="0" description="SSU Error aggregator Error Type Register">
		<bitfield id="CPU1_SSU_MMR_ACCESS_ERROR" description="CPU1_SSU_MMR_ACCESS_ERROR" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="CPU2_SSU_MMR_ACCESS_ERROR" description="CPU2_SSU_MMR_ACCESS_ERROR" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="CPU3_SSU_MMR_ACCESS_ERROR" description="CPU3_SSU_MMR_ACCESS_ERROR" begin="3" end="3" width="1" rwaccess="R"/>
		<bitfield id="MODE_INVALID" description="BANKMAP, SECVALID, BANKMODE, SSUMODE invalid" begin="7" end="7" width="1" rwaccess="R"/>
		<bitfield id="FLC1_ERROR_STS" description="FLC1_ERROR_STS " begin="8" end="8" width="1" rwaccess="R"/>
		<bitfield id="FLC1_ERROR_TYPE" description="FLC1_ERROR_TYPE" begin="11" end="9" width="3" rwaccess="R"/>
		<bitfield id="FLC1_MMR_ACCESS_ERROR" description="FLC1_MMR_ACCESS_ERROR" begin="12" end="12" width="1" rwaccess="R"/>
		<bitfield id="FLC2_ERROR_STS" description="FLC2_ ERROR_STS" begin="13" end="13" width="1" rwaccess="R"/>
		<bitfield id="FLC2_ERROR_TYPE" description="FLC2_ERROR_TYPE" begin="16" end="14" width="3" rwaccess="R"/>
		<bitfield id="FLC2_MMR_ACCESS_ERROR" description="FLC2_MMR_ACCESS_ERROR" begin="17" end="17" width="1" rwaccess="R"/>
		<bitfield id="HP_SOFTWARE_ERR" description="high priority error set by software" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="SSU_ERROR_TYPE_FRC" width="32" page="0" offset="0x88c" instances="1" instaddr="4" internal="0" description="SSU Error aggregator Error Type Force Register">
		<bitfield id="CPU1_SSU_MMR_ACCESS_ERROR" description="CPU1_SSU_MMR_ACCESS_ERROR force" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_SSU_MMR_ACCESS_ERROR" description="CPU2_SSU_MMR_ACCESS_ERROR force" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CPU3_SSU_MMR_ACCESS_ERROR" description="CPU3_SSU_MMR_ACCESS_ERROR force" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MODE_INVALID" description="BANKMAP, SECVALID, BANKMODE, SSUMODE invalid  force" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="FLC1_ERROR_STS" description="FLC1_ERROR_STS  force" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="FLC1_ERROR_TYPE" description="FLC1_ERROR_TYPE force" begin="11" end="9" width="3" rwaccess="RW"/>
		<bitfield id="FLC1_MMR_ACCESS_ERROR" description="FLC1_MMR_ACCESS_ERROR force" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="FLC2_ERROR_STS" description="FLC2_ ERROR_STS force" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="FLC2_ERROR_TYPE" description="FLC2_ERROR_TYPE force" begin="16" end="14" width="3" rwaccess="RW"/>
		<bitfield id="FLC2_MMR_ACCESS_ERROR" description="FLC2_MMR_ACCESS_ERROR force" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="force high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="SSU_ERROR_TYPE_CLR" width="32" page="0" offset="0x890" instances="1" instaddr="4" internal="0" description="SSU Error aggregator Error Type Clear Register">
		<bitfield id="CPU1_SSU_MMR_ACCESS_ERROR" description="CPU1_SSU_MMR_ACCESS_ERROR Clear" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CPU2_SSU_MMR_ACCESS_ERROR" description="CPU2_SSU_MMR_ACCESS_ERROR Clear" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CPU3_SSU_MMR_ACCESS_ERROR" description="CPU3_SSU_MMR_ACCESS_ERROR Clear" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="MODE_INVALID" description="BANKMAP, SECVALID, BANKMODE, SSUMODE invalid  Clear" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="FLC1_ERROR_STS" description="FLC1_ERROR_STS  Clear" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="FLC1_ERROR_TYPE" description="FLC1_ERROR_TYPE Clear" begin="11" end="9" width="3" rwaccess="RW"/>
		<bitfield id="FLC1_MMR_ACCESS_ERROR" description="FLC1_MMR_ACCESS_ERROR Clear" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="FLC2_ERROR_STS" description="FLC2_ ERROR_STS Clear" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="FLC2_ERROR_TYPE" description="FLC2_ERROR_TYPE Clear" begin="16" end="14" width="3" rwaccess="RW"/>
		<bitfield id="FLC2_MMR_ACCESS_ERROR" description="FLC2_MMR_ACCESS_ERROR Clear" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="clear high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="ETHERCAT_HIGHPRIO_ERROR_ADDRESS" width="32" page="0" offset="0x8c0" instances="1" instaddr="4" internal="0" description="ETHERCAT Error aggregator High Priority Error address register">
		<bitfield id="ETHERCAT_HIGHPRIO_ERROR_ADDRESS" description="Address at which first High priority error occurred" begin="31" end="0" width="32" rwaccess="R"/>
	</register>
	<register id="ETHERCAT_ERROR_TYPE" width="32" page="0" offset="0x8c8" instances="1" instaddr="4" internal="0" description="ETHERCAT Error aggregator Error Type Register">
		<bitfield id="UNCERR" description="Uncorrectable error " begin="6" end="6" width="1" rwaccess="R"/>
		<bitfield id="HP_SOFTWARE_ERR" description="high priority error set by software" begin="31" end="31" width="1" rwaccess="R"/>
	</register>
	<register id="ETHERCAT_ERROR_TYPE_FRC" width="32" page="0" offset="0x8cc" instances="1" instaddr="4" internal="0" description="ETHERCAT Error aggregator Error Type Force Register">
		<bitfield id="UNCERR" description="Uncorrectable error force" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="force high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="ETHERCAT_ERROR_TYPE_CLR" width="32" page="0" offset="0x8d0" instances="1" instaddr="4" internal="0" description="ETHERCAT Error aggregator Error Type Clear Register">
		<bitfield id="UNCERR" description="Uncorrectable error clear" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="HP_SOFTWARE_ERR" description="clear high priority software error" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
</module>
